import 'drop_text_model.dart';

class K7Controller {
  final termsOfUse = DropTextModel('условия пользования', <DropTextModel>[
    DropTextModel('Введение', <String>['''Редакция от “20” апреля 2023 г.

Настоящие Условия использования и Политика конфиденциальности являются публичным договором - договором публичной оферты в соответствии с пунктом 2 статьи 437 Гражданского кодекса Российской Федерации, самозанятого физического лица Егоровой Галины Геннадьевны, ИНН: 424601190290. Все его условия одинаковы для всех пользователей, независимо от статуса и организационно-правовой формы.

Условия использования и Политика конфиденциальности распространяются на получение Пользователем (Далее по тексту — «вы» ,«вас»,«ваш», «вам») услуг, доступ и использование Веб-сайта https://rigelpsy.ru и\или мобильного приложения RIGEL PSY и всех других продуктов и услуг RIGEL PSY (Далее по тексту — сервисы, сервис, приложение, Веб-сайт, https://rigelpsy.ru, «мы» ,«нас»,«наш»).

Любое дальнейшее использование Веб-сайта и\или Приложения или любой их части, в том числе получение услуг, означает что вы прочитали и поняли Условия использования и Политику конфиденциальности и соглашаетесь соблюдать все разделы Условий использования и Политики конфиденциальности.

Полным и безоговорочным акцептом настоящей публичной оферты считается факт начала пользования Сервисом и регистрация на Веб-сайте и\или в мобильном приложении.
''']),
    DropTextModel('Минимальный возраст', <String>['''Услуги на Веб-сайте и\или в приложении доступны только лицам, достигшим совершеннолетия в соответствии с законодательством страны резидентом и\или гражданином которой такое лицо является и способным заключать юридически обязывающие договоры в соответствии с действующим законодательством. Не ограничивая вышесказанное, Услуги на Веб-сайте и\или в приложении не предназначены для использования несовершеннолетними лицами. Если вы не соответствуете этим требованиям, пожалуйста, не пользуйтесь Услугами и не заходите на Веб-сайт и\или не скачивайте приложение.''']),
    DropTextModel('Изменения в Условиях использования', <String>['''Положения настоящих  условий использования и Политики конфиденциальности могут быть в дальнейшем изменены. Каждый раз, когда мы вносим изменения в эту Политику конфиденциальности и  условия использования, мы опубликуем ее новую редакцию на этой странице и укажем дату новой редакции.
Любые изменения в настоящих Условиях и Политике вступают в силу немедленно после их публикации. Продолжение использования вами Сервиса после внесения изменений в настоящие Условия и политику означает ваше согласие с этими изменениями. Если вы не желаете соглашаться с любыми изменениями настоящих Условий и Политики, немедленно прекратите использование Сервиса.
Эти Условия и политика также будут регулировать любые обновления или новые версии Веб-сайта или Приложения, которые могут заменить и/или дополнить исходное Приложение, или Веб-сайт. Если обновление или новая версия не сопровождаются Условиями и Политикой, настоящие Условия и Политика имеют преимущественную силу.
''']),
    DropTextModel('Термины и определения', <String>['''Услуга - доступ к функциональным возможностям Сервиса, позволяющим осуществить взаимодействие с сервисом, по вопросу индивидуальной психологической работы.
Пользователь - любое физическое или юридическое лицо (действующее в интересах физического лица), пользующееся услугами на Веб-сайте https://rigelpsy.ru и\или в приложении.
Подписка - предоставление Пользователю на условиях Договора возможности за плату в течение ограниченного промежутка времени получить в отношении сервиса определенное количество Услуг.
Администратор - Егорова Галина Геннадьевна 
Администрация - сотрудники Администратора, осуществляющие управление Веб-сайтом https://rigelpsy.ru, выполняющие технические, организационные и другие функции по обеспечению функционирования сервисов Веб-сайта https://rigelpsy.ru, а также предоставляют информационную, консультационную и иную поддержку Веб-сайта https://rigelpsy.ru.
Контент - изображения, текстовые, аудио- и видеоматериалы, а также иные объекты авторских и (или) смежных прав, а равно не являющиеся таковыми информация и сообщения любого характера, доступные на Веб-сайте и\или в приложении.
"Платежная система Ю Kassa" - партнер RIGEL PSY, который обеспечивает безопасные платежи между Пользователем и сервисом. Для использования "Платежной системы", Пользователь обязан принять все необходимые пользовательские соглашения, договор-оферту "Платежной системы", и другие документы, на основании которых осуществляется работа с "Платежной системой".''']),
    DropTextModel('Общие условия', <String>['''Администратор предоставляет Пользователю безвозмездную, не ограниченную по территории, простую (неисключительную), ограниченную лицензию на использование Веб-сайта https://rigelpsy.ru и\или приложения а также Сервиса в целом.
Регистрация на Веб-сайте и\или в приложении является бесплатной, однако, отдельные функции Сервиса (например подписка), могут быть платными. Оплата Пользователем таких функций производится посредством платежных систем, предложенных в Сервисе. 
''']),
    DropTextModel('Предмет', <String>['''Предметом Договора является предоставление Администратором Пользователю, доступа к функциональным возможностям Сервиса, позволяющим осуществить взаимодействие с сервисом по вопросу индивидуальной психологической работы с Пользователем, включая ведение дневника, трекеры настроения и самочувствия, подробная аналитика, психосоматика, СМЭР отчеты а также психологические аудио сессии, профессиональные рекомендации,упражнения и медитации.''']),
    DropTextModel('Регистрация', <String>['''Для получения услуг на сайте, Пользователь должен должен указать: 
Логин  
Адрес электронной почты.
Отправка такой информации в наш адрес будет считаться вашим согласием предоставить в случае необходимости, личную информацию для проверки личности. Такая информация будет использоваться для проверки личности Пользователя (ей), выявления фактов-следов отмывания денег, финансирования терроризма, мошенничества и других финансовых преступлений через наш сервис или для других законных целей, заявленных нами. Мы будем собирать, использовать и передавать такую информацию в соответствии с нашей Политикой конфиденциальности. Помимо предоставления такой информации, вы соглашаетесь разрешить нам вести учет этой информации в течение периода пять (5) лет после отправки такой информации в соответствии с глобальными отраслевыми стандартами хранения данных. Вы также разрешаете нам проводить необходимые расследования напрямую или через третьих лиц для проверки вашей личности или защиты вас и / или нас от финансовых преступлений, таких как мошенничество. Информация, которая нам требуется для подтверждения вашей личности, может включать, помимо прочего, контактную информацию, адрес электронной почты, удостоверение личности государственного образца, дату рождения и другую информацию. Предоставляя необходимую информацию, вы подтверждаете, что она верна и точна.
''']),
    DropTextModel('Запрещённое использование', <String>['''Вы соглашаетесь не загружать, не размещать, не отправлять по электронной почте или иным образом не передавать любые материалы, которые содержат программные вирусы или любой другой компьютерный код, файлы или программы, предназначенные для того, чтобы прерывать, вредить, повреждать, уничтожать или ограничивать функциональность любого компьютерного программного обеспечения или аппаратного обеспечения или оборудования, прямо или косвенно связанного с Веб-сайтом или Приложением. Вы соглашаетесь не
вмешиваться в работу серверов или сетей, лежащих в основе или связанных с данным Веб-сайтом или Приложением а также не нарушать любые процедуры, политики или правила сетей, подключенных к Веб-сайту и\или Приложению.
Вы соглашаетесь не сдавать в аренду, сублицензировать, переводить, объединять, адаптировать или изменять приложение RIGEL PSY или любую связанную документацию, использовать Веб сайт или приложение RIGEL PSY только в личных целях (если вы являетесь потребителем) или для внутренних бизнес-целей, (если вы являетесь бизнесом). 
Вы соглашаетесь не разрешать какой-либо третьей стороне копировать, адаптировать, реконструировать, декомпилировать, дизассемблировать, изменять или исправлять ошибки в на Веб-сайте или приложении RIGEL PSY полностью или частично, не подвергать обратному инжинирингу или создавать производные работы на основе всего или какой-либо части Веб-сайта или приложения RIGEL PSY, а также пытаться делать что-либо подобное. Приложение и Веб-сайт могут содержать определенное стороннее программное обеспечение, плагины или интерфейс приложений (совместно именуемые «Стороннее программное обеспечение»), для которых требуются отдельные Условия соглашения. 
Вы соглашаетесь не выдавать себя или пытаться выдать себя за компанию RIGEL PSY, сервис RIGEL PSY, сотрудника компании RIGEL PSY, другого пользователя или любое другое физическое или юридическое лицо (включая, помимо прочего, использование адресов электронной почты или псевдонимов, связанных с любым из вышеизложенного).
Вы соглашаетесь не передавать или обеспечивать отправку любых рекламных или маркетинговых материалов без нашего предварительного письменного согласия, включая любую «нежелательную почту», «письма счастья», «спам» или любые другие подобные запросы.
Вы соглашаетесь не использовать услуги для манипулирования рынком.
''']),
    DropTextModel('Права интелектуальной собственности', <String>['''Совокупность программ, данных, торговых марок, объектов интеллектуальной собственности в том числе объектов авторского права, и других объектов, используемых на Веб-сайте или в Приложении, являются интеллектуальной собственностью его законных правообладателей и охраняются законодательством об интеллектуальной собственности, а также соответствующими международными правовыми договорами и конвенциями.
Любое использование элементов которые входят в состав Веб сайта или Приложения   (символика, текст, графические изображения, программы и другие объекты), кроме разрешенного в настоящем Документе, без разрешения является незаконным и может послужить причиной для судебного разбирательства и привлечения к гражданско-правовой, административной и уголовной ответственности в соответствии с законодательством.
Если Вы являетесь владельцем торговой марки и/или других объектов интеллектуальной собственности и считаете, что материалы, размещенные на Веб-сайте или в Приложении, нарушают ваши права, пожалуйста, напишите нам на электронный адрес: support@rigelpsy.ru.   
В обращении, пожалуйста, укажите следующую информацию: 
идентифицируйте себя (имя, адрес для переписка, электронная почта); 
опишите характер нарушения прав интеллектуальной собственности и идентифицируйте соответствующий объект интеллектуальной собственности на Веб-сайте или в Приложении.
''']),
    DropTextModel('Полагание на опубликованную информацию', <String>['''Информация, представленная на Веб-сайте https://rigelpsy.ru или через него а также в Приложении предоставляется исключительно для общих информационных целей. Мы не гарантируем точность, полноту или полезность этой информации. Вы полагаетесь на такую ​​информацию исключительно на свой страх и риск. Мы снимаем с себя всякую ответственность и ответственность, возникающую в связи с использованием таких материалов вами или любым другим посетителем Веб-сайта и\или Приложения, или любым лицом, которое может быть проинформировано о его содержании.
''']),
    DropTextModel('Ссылки на веб-сайты и функции социальных сетей', <String>['''Вы можете ссылаться на наш Веб-сайт, при условии, что вы делаете это честно и законно, не наносите ущерба нашей репутации или не пользуетесь ею, но вы не должны устанавливать ссылку таким образом, чтобы предлагать какую-либо форму ассоциации или одобрение с нашей стороны без нашего явного письменного согласия.
Если на веб-сайтах есть ссылки на другие сайты и ресурсы, предоставленные третьими сторонами, эти ссылки предоставляются только для вашего удобства. Сюда входят ссылки, содержащиеся в рекламных объявлениях, включая рекламные баннеры и спонсорские ссылки. Мы не контролируем содержимое этих сайтов или ресурсов и не несем ответственности за них или за любые убытки или ущерб, которые могут возникнуть в результате их использования вами. Если вы решите получить доступ к любому из сторонних веб-сайтов, связанных с этим Веб-сайтом, вы делаете это исключительно на свой страх и риск и в соответствии с условиями использования таких веб-сайтов.
  ''']),
    DropTextModel('Ограничеие ответственности', <String>['''RIGEL PSY будет прилагать все разумные усилия для надлежащей работы Веб-сайта https://rigelpsy.ru и Приложения, однако не будет нести ответственности перед Пользователем или третьими лицами за прямые и/или косвенные убытки, включая упущенную выгоду или потерянные данные, вред чести, достоинству или деловой репутации, понесенные в связи с использованием Веб-сайта https://rigelpsy.ru или Приложения, или невозможности их использования, или несанкционированного доступа к коммуникациям Пользователя третьими лицами, или невозможность получения услуг, в частности, в следующих случаях:

a) 	при наличии технологических неисправностей каналов связи общего пользования 	или потери доступа к сети Интернет - до устранения неисправностей или 		восстановления доступа, соответственно;

b) 	при наличии признаков несанкционированного доступа к управлению учетной записью Пользователя - на срок действия таких обстоятельств;

c) 	при нарушении безопасности оборудования или неисправности оборудования (персонального компьютера,смартфона), который используется Пользователем для 	получения услуг на Веб-сайте https://rigelpsy.ru (доступ к Аккаунту).

RIGEL PSY не несет ответственности за любые убытки, возникшие у Пользователя в результате того, что Пользователь не ознакомился или несвоевременно ознакомился с условиями изложенными в настоящем соглашении.
Пользователь  согласен с тем, что условия ограничения ответственности, изложенные выше, отображают умное и справедливое распределение рисков. Во избежании неверного толкования положений об ограничении ответственности, стороны прямо отмечают, что Пользователю не будет отказано в любых законных правах или правах, которые возникают в связи с договорными отношениями между Пользователем и RIGEL PSY.
Стороны освобождаются от ответственности за задержку и/или частичное или полное неисполнение обязательств по настоящему Соглашению, если это неисполнение явилось следствием обстоятельств непреодолимой силы (Форс-мажор), которые находятся вне контроля сторон, и преодолеть которые разумными методами невозможно.

Сервис RIGEL PSY не оказывает медицинские услуги. Пользователь понимает, что Сервис предназначен для относительно здоровых людей, которые не имеют проблем со здоровьем (как физических, так и психологических), угрожающих жизни Пользователя или иных лиц. Пользователь подтверждает и гарантирует, что незамедлительно уведомит Сервис о любых изменениях в психическом и физическом состояниях.
Сервис RIGEL PSY не несет ответственности за недостижение Пользователем ожидаемых им результатов, либо несоответствие полученного результата ожиданиям Пользователя.
Неудовлетворенность Пользователя результатами деятельности Сервиса, несоответствие результата психологической помощи его ожиданиям не является основанием для привлечения Администратора к ответственности за ненадлежащее качество оказанных услуг, так как психологическая помощь не имеет установленных стандартов правильного осуществления.
''']),
    DropTextModel('Географические ограничения', <String>['''Администратор веб-сайта https://rigelpsy.ru не делает никаких заявлений о том, что Веб-сайт или какой-либо контент доступен или уместен во всех частях света. Доступ к Веб-сайту https://rigelpsy.ru может быть незаконным для определенных лиц или в определенных странах. Если вы заходите на Веб-сайт https://rigelpsy.ru, то это будет происходить по Вашей собственной инициативе и Вы несете ответственность за соблюдение местных законов.''']),
    DropTextModel('Возмещение', <String>['''Вы соглашаетесь оградить RIGEL PSY, его аффилированных лиц, лицензиаров и поставщиков услуг, а также его должностных лиц, директоров, сотрудников, подрядчиков, агентов, правопреемников от любых претензий и обязательств, убытков, судебных решений, издержек, расходов или гонораров (включая разумные гонорары адвокатам), возникающие в результате или связанные с нарушением вами настоящих Условий использования или использованием вами Веб-сайта https://rigelpsy.ru, включая, помимо прочего, любое использование содержание, услуги или продукта, кроме тех, которые прямо разрешены в настоящих Условиях использования.

Ответственность Администратора по любым искам или претензиям, связанным с выполнением данного Договора, ограничивается суммой 1 000 (одна тысяча) рублей и не может превышать сумм, фактически уплаченных Администратору за оказанные в соответствии с настоящим Договором услуги либо реального ущерба, причиненного Администратором Пользователю, в зависимости от того, какая из этих сумм окажется меньшей. Данное ограничение не применяется в случае, если законодательством Российской Федерации установлено иное.
''']),
    DropTextModel('Регулирующее законодательство и юрисдикция', <String>['''Все вопросы, связанные с сервисом RIGEL PSY,  Веб-сайтом https://rigelpsy.ru, приложением RIGEL PSY и настоящими Условиями использования, а также любые споры или претензии, возникающие из них или связанные с ними (в каждом случае, включая внедоговорные споры или претензии), регулируются и толкуются в соответствии с законодательством Российской Федерации, без осуществления любого выбора или положения или правила коллизионного права.

Любой судебный иск или судебное разбирательство, вытекающие из настоящих Условий использования или связанных с ним лиц, должно быть возбуждено исключительно в Российской Федерации, хотя мы сохраняем за собой право подать любой иск, или инициировать судебное разбирательство против вас за нарушение настоящих Условий использования в стране Вашего проживания или любой другой соответствующей стране. Вы отказываетесь от любых возражений против осуществления юрисдикции над вами такими судами и против рассмотрения дела в таких судах.
''']),
    DropTextModel('Политика возврата денежных средств', <String>['''Если Пользователь ошибочно/повторно оплатил услуги, или оплатил их стоимость в большем размере, чем требовалось - уплаченные средства подлежат возврату.
Не позднее 60 минут после ложной / повторной оплаты Пользователь обязан сообщить нам на адрес электронной почты support@rigelpsy.ru, сообщением \ письмом в произвольной форме об ошибочном/повторном платеже и желание вернуть средства, указав в теме письма «Возврат средств», при этом обязательно указав, дату платежа, способ платежа, адрес электронной почты Пользователя. Запрос на возврат средств рассматривается нами в ближайшее время, но не более двух рабочих дней. После рассмотрения запроса мы уведомим Вас о результате и сроке возврата или отказа в
возврате денежных средств. Возврат денежных средств производится тем же способом, которым осуществлена оплата. Срок возврата платежа зависит от способа первоначальной оплаты. Комиссия (если таковая предусмотрена платежной системой или банком за обратный перевод денежных средств) будет вычтена из суммы, подлежащей возврату. В случае не уведомления нас об ошибочном/повторном платеже, согласно условиям указанным выше, такой платеж признается нами таким как оплаченным должным образом. Во всех иных случаях, возврат денежных средств не осуществляется.
''']),
    DropTextModel('Другие условия', <String>['''Использование Приложения во время вождения
Всегда едьте осторожно и в соответствии с дорожными условиями и применимыми правилами дорожного движения. Любое прямое взаимодействие с Приложением запрещено во время вождения. Если вы хотите взаимодействовать с Приложением во время вождения, вы должны сначала остановить свой автомобиль надлежащим и законным образом и в нужном месте. Вы признаете, что несете ответственность за соблюдение всех применимых законов, когда вы используете Приложение любым способом во время вождения, и что вы используете Приложение любым образом во время вождения на свой страх и риск. 
RIGEL PSY НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБОЙ ПРЯМОЙ ИЛИ КОСВЕННЫЙ УЩЕРБ, В ТОМ ЧИСЛЕ НЕСЧАСТНЫЙ СЛУЧАЙ, ТРАВМУ ИЛИ ДРУГИЕ УБЫТКИ СВЯЗАННЫЕ С ИСПОЛЬЗОВАНИЕМ ПРИЛОЖЕНИЯ ВО ВРЕМЯ ВОЖДЕНИЯ.''']),
    DropTextModel('Реквизиты', <String>['''Наши контактные данные: 
Егорова Галина Геннадьевна 
ИНН 424601190290
652300, Кемеровская область, 
г. Топки, ул. Лермонтова, д. 2, кв. 32
Email: support@rigelpsy.ru ''']),
  ]);

  final privacyPolicy = DropTextModel('Политика конфиденциальности и обработки персональных данных', <DropTextModel>[
    DropTextModel('Введение', <String>['''Редакция от “20” апреля  2023 г.

Эта Политика конфиденциальности описывает, как https://rigelpsy.ru (Далее - “Сервис” или “мы”,“нами”, “нас”) использует и передает Информацию, собранную нами или предоставленную Вами во время посещения Веб-сайта, который размещен по адресу: https://rigelpsy.ru, и\или использования приложения RIGEL PSY.

Владельцем персональных данных является, самозанятое физическое лицо Егорова Галина Геннадьевна, ИНН: 424601190290

Эта Политика конфиденциальности также разъясняет Ваши права и возможности в отношении Ваших персональных Данных, а также то, как Вы можете связаться с нами, чтобы внести изменения в Ваши персональные данные или получить ответы на вопросы, которые могут возникнуть у Вас относительно наших практик в сфере конфиденциальности.
Положения настоящей Политики Конфиденциальности могут быть изменены в дальнейшем. Каждый раз, когда мы вносим изменения в эту Политику конфиденциальности, мы опубликуем ее новую редакцию на этой странице и укажем дату новой редакции.

Пожалуйста, внимательно прочитайте положения этой Политики Конфиденциальности и свяжитесь с нами по электронной почте, указанной в этом документе, если у вас возникнут вопросы. Используя Веб-сайт или приложение а также получая услуги в приложении, вы соглашаетесь со всеми условиями настоящей Политики конфиденциальности, подтверждаете свое ознакомление с изложенными здесь условиями и даете нам свое свободное и однозначное согласие использовать Ваши Персональные данные в соответствии с условиями настоящей Политики конфиденциальности.
''']),
    DropTextModel('Определение терминов', <String>['''Владелец персональных данных - юридическое лицо, которое определяет цель обработки персональных данных, устанавливает состав этих данных и процедуры их обработки, если иное не определено законом.
Персональные данные - сведения или совокупность сведений о физическом лице, которое идентифицировано или может быть конкретно идентифицировано.
Неперсональные Данные - информация и сведения, которые сами по себе не позволяют непосредственно идентифицировать конкретное лицо.
Информация - как Персональные, так и не персональные Данные.
Пользователь - физическое лицо, получающее доступ к Веб-сайту https://rigelpsy.ru, и\или приложению, пользующееся им и/или осуществляющее заказ соответствующих услуг.
Сервис - Веб-сайт https://rigelpsy.ru и\или приложение RIGEL PSY.
Обработка - любые действия с персональными данными в том числе, но не исключительно: доступ, предоставление, распространение, сбор, систематизация, хранение, накопление, запись, передача, блокирование, удаление, уточнение, обновление и/или изменение, обезличивание и другие способы использования персональных данных, осуществляемые Сервисом.
Закон - Федеральный закон РФ N 152-ФЗ.''']),
    DropTextModel('Общие положения', <String>['''Мы обрабатываем Ваши Персональные данные в соответствии с законом, исключительно для выполнения-обработки Вашей заявки, заявки, поручения и предоставления необходимой информации о состоянии ее выполнения, участия в рекламных активностях нашей Сервиса, при обращении к клиентской поддержке, а также когда Вы подписываетесь на наши рассылки, участвуете в опросах или оставляете отзывы о наших услугах.

Информация предоставленная Вами является конфиденциальной и не передается третьим лицам, кроме необходимости выполнения Вашей, заявки, поручения, а также других случаев, предусмотренных законодательством.

Положения настоящей Политики Конфиденциальности применяются только к Веб-сайту https://rigelpsy.ru и\или приложению RIGEL PSY. Сервис не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылками, доступным на Сайте.

Пожалуйста, обратите внимание, что Сервис не проверяет достоверность информации предоставленной Пользователем.

Информация о Вас обрабатывается с момента Вашего входа на сайт или использования приложения а также с момента получения Сервисом Ваших персональных данных, направленных по электронной почте, через сайт или предоставленных через другие средства коммуникаций.
''']),
    DropTextModel('ИНФОРМАЦИЯ, КОТОРУЮ МЫ МОЖЕМ СОБИРАТЬ ИЛИ ПОЛУЧАТЬ', <String>['''Сервис собирает и использует только те персональные данные пользователей, которые необходимы для выполнения их заказа услуги. Для Пользователя - это 
Логин  
Адрес электронной почты.


Другая информация может быть предоставлена ​​пользователем исключительно на его усмотрение (кроме случаев, если такая информация требуется для обеспечения возможности выполнения договора или ее предоставление предусмотрено законодательством).

Кроме того, мы используем технологию “cookie” для сбора дополнительных данных об использовании сайта и для улучшения работы сайта, повышения качества наших услуг. 

Cookie-файлы - это небольшие файлы, которые Сайт, приложение, сервисы сетевого программного обеспечения или поставщики услуг, помещают в устройство через веб-браузер (если это разрешено Вами), что позволяет сайту или поставщикам услуг распознавать Ваш браузер и хранить и запоминать определенную информацию.

С помощью cookie-файлов мы можем обрабатывать такую ​​Информацию как:

Данные об устройстве: аппаратная модель, уникальные идентификаторы устройства, MAC-адрес, IP- адрес, версия операционной системы и настройки устройства;
Информацию из Log-файлов: Время и продолжительность использования сайта, поисковые запросы, информация о местонахождении и любая другая информация, хранящаяся в Cookie-файлах, что позволяет однозначно идентифицировать Ваш браузер или аккаунт;
Другие данные: данные об использовании Вами сайта, которые мы можем обрабатывать, если Вы посещаете или используете сторонние веб-сайты или приложения для связи с нами, о том, как Вы взаимодействуете с контентом, размещенным на Веб-сайте.

Мы используем Cookie-файлы для многих важных вещей - например, чтобы помочь Вам войти в систему и чтобы улучшить Ваш опыт пользования нашим Веб-сайтом, приложением или услугами. Мы можем использовать Cookie-файлы для того, чтобы лучше понять как Вы взаимодействуете с Веб-сайтом или приложением, отслеживать общее количество пользователей Веб-сайта или приложения и маршрутизацию веб-трафика на Веб-сайте или в приложении, совершенствовать Веб-сайт, приложение и наши услуги, чтобы понять Ваши предпочтения на основе предыдущей или текущей активности на Веб-сайте и\или в приложении, что позволит нам предоставлять Вам услуги высшего качества.

Мы не собираем и просим Вас не предоставлять нам любую Информацию, по обработке которой Законом установлены определенные ограничения и требования, а именно - информацию о расовом или этническом происхождении, о политических, религиозных или мировоззренческих убеждениях, о членстве в политических партиях и профессиональных союзах, судимостей по уголовным делам или о подозрении в совершении преступлений по уголовным делам, а также данные, касающиеся здоровья, половой жизни, биометрических и генетических данных.
''']),
    DropTextModel('КАК МЫ МОЖЕМ ИСПОЛЬЗОВАТЬ ПЕРСОНАЛЬНЫЕ ДАННЫЕ', <String>['''Мы можем использовать Информацию, собранную нами, как описано выше, в следующих целях:

Договорные отношения. 
Мы можем обрабатывать Ваши Персональные Данные для выполнения договорных обязательств - для рассмотрения и\или оформления Вашей заявки на подписку.

Запросы и другие коммуникации. 
В случае, если Вы связались с нами через наши контактные формы и / или по электронной почте / телефону, мы можем обрабатывать Информацию, которую Вы нам предоставили, чтобы иметь возможность ответить на ваш вопрос, жалобу или запрос.

Маркетинг. 
Мы можем использовать Информацию, полученную от Вас (например, вашу электронную почту) в маркетинговых целях. Например, подписавшись на нашу новостную рассылку, Вы сможете получать публикации и объявления прямо на свою электронную почту. Мы можем посылать Вам рекламные материалы, касающиеся наших услуг, акционных предложений, которые, по нашему мнению, могут Вас заинтересовать.

Вы можете отказаться от получения наших маркетинговых электронных рассылок (как полностью, так и частично), нажав на ссылку “отменить подписку” в электронных письмах, которые Вы получаете от нас. Кроме того, для того, чтобы отменить подписку, Вы можете в любой момент связаться с нами отправив нам сообщение на адрес электронной почты, указанный в настоящей Политике конфиденциальности.

Мы также можем использовать Информацию, полученную с помощью Cookie-файлов с целью проведение маркетинговых исследований, для анализа характеристик пользователей сайта, оценки эффективности нашей маркетинговой связи и для приспособления к существующим тенденциям, для планирование наших будущих маркетинговых кампаний, бизнес-аналитики, персонализации сервисов и коммуникаций для Вас.

Защита наших интересов, безопасность. 
Мы можем использовать Ваши персональные данные, когда считаем необходимым принятие мер по предотвращению возможного наступления ответственности, для осуществления расследований и защиты Сервиса от любых претензий или обвинений третьих лиц, расследований и защиты Сервиса от мошенничества, защиты безопасности или целостности Веб-сайта и защиты прав  собственности нашей Сервиса, пользователей и/или партнеров.

Соответствие требованиям Закона. 
Мы также можем использовать / раскрывать Вашу Информацию, собранную нами, чтобы соответствовать законодательным требованиям, отраслевым стандартам и нашей политике. Мы можем раскрывать Вашу Информацию в ситуациях, которые, по нашему мнению: 
(1) является чрезвычайными ситуациями,связанными с потенциальной угрозой физической безопасности любого лица или имущества, если мы считаем, что Ваша Информация любым образом связана с такой угрозой; 
(2) является связанной с незаконным или неподходящим, по нашему мнению, использованием Сайта, и/или услуг.

Обработка Информации включает:

Сбор, накопление, хранение, адаптирование, проверку, изменение, восстановление, использование, обезличивание, уничтожение персональных данных, в том числе с использованием информационных (Автоматизированных) систем.
Сбор персональных данных может происходить в устной, письменной и / или электронной форме, путем запросов или самостоятельного предоставления Вами необходимых сведений и документов. Персональные данные накапливаются и хранятся в письменной и / или электронной форме.
''']),
    DropTextModel('КАК МЫ МОЖЕМ ПЕРЕДАВАТЬ ПЕРСОНАЛЬНЫЕ ДАННЫЕ', <String>['''Мы уделяем особое внимание конфиденциальности и защите Ваших персональных данных. Информация предоставленная Вами является конфиденциальной и не передается третьим лицам, кроме необходимости выполнения или предоставления услуг (и), а также случаев, предусмотренных законодательством.

Пользователь соглашается с тем, что Сервис имеет право передавать персональные данные пользователей, - исключительно с целью выполнения соответствующей услуги.

Мы можем раскрывать Ваши Персональные Данные, если этого требует Закон или с целью выполнения юридического обязательства или если мы уверены, что такие действия необходимы для: 
Расследования, реагирования и защиты относительно претензий; если это необходимо в судебном процессе (в том числе и для вызова в суд) для защиты прав и собственности Сервиса или третьих лиц; для предотвращения возможного наступления ответственности; 
в целях общественной безопасности или безопасности отдельных лиц; 
С целью предотвращения или прекращения любой незаконной, неэтичной, мошеннической, оскорбительной и иной деятельности, которая может привести к негативным юридическим последствиям; 
Для целостности и безопасности Веб-сайта, приложения,  наших услуг, любого оборудования, используемого в работе Веб-сайта или приложения при предоставлении услуг; 
Для соблюдения требований действующего законодательства.
''']),
    DropTextModel('КАК МЫ ХРАНИМ И ЗАЩИЩАЕМ ВАШИ ПЕРСОНАЛЬНЫЕ ДАННЫЕ', <String>['''Защита ваших персональных данных является чрезвычайно важной для нас, поэтому мы принимаем все необходимые меры для этого. Мы храним персональные данные пользователей в безопасных условиях. Ваши Персональные данные защищены от несанкционированного доступа, раскрытия, использования, изменения или уничтожения.

Сервис на постоянной основе осуществляет контроль за принятыми мерами по обеспечению безопасности.

Мы будем хранить Ваши Персональные Данные в течение срока, когда они необходимы для предоставления Вам доступа к Сайту и/или приложению для выполнения наших юридических обязательств (выполнение Ваших заявок и предоставления услуг, налоговой и\или финансовой отчетности.), разрешении споров и соответствия нашей политики.

Срок хранения определяется с учетом типа собранной Информации, и цели, ради которой она собиралась в зависимости от ситуации и необходимости удаления устаревшей или ненужной Информации в кратчайшие сроки.

После того, как Вы прекращаете пользоваться нашими услугами, путем удаления своей учетной записи на (если такая регистрация предусмотрена), Ваши Персональные Данные также автоматически удаляются (кроме случаев, когда мы вынуждены хранить такие данные для выполнения обязанностей установленных действующим законодательством и этими Правилами использования).
''']),
    DropTextModel('ВАШИ ПРАВА', <String>['''Относительно Ваших персональных данных, Вы имеете право:

в любое время обратиться к владельцу персональных данных с любыми вопросами и жалобами по обработке персональных данных, а также спросить обрабатываются ли Ваши персональные данные и о содержании таких персональных данных;

на бесплатный доступ к своим персональным данным;

в любое время просить владельца персональных данных отменить или ограничить обработку персональных данных, а также требовать внесения изменений в персональные данные, если в них имеются неточности или они потеряли актуальность;

в любое время просить владельца персональных данных удалить персональные данные в том объеме, в котором они больше не нужны для достижения указанных в этом уведомлении целей или других целей, в которых владельцу необходимо продолжать их обработку, или когда владелец персональных данных больше не имеет законного права обрабатывать их;

в любое время отозвать свое согласие на обработку персональных данных;

обращаться с жалобами на обработку персональных данных;

знать об источниках сбора, местонахождении персональных данных, цели их обработки, местонахождении владельца или распорядителя персональных данных или дать соответствующее поручение о получении этой информации уполномоченным им лицам, кроме случаев, установленных законом;

получать информацию об условиях предоставления доступа к персональным данным, включая информацию о третьих лицах, которым передаются персональные данные;

предъявлять мотивированное требование владельцу с возражением против обработки своих персональных данных;

на защиту своих персональных данных от незаконной обработки и случайной потери, уничтожения, повреждения в связи с умышленным сокрытием, непредоставлением или несвоевременным их предоставлением, а также на защиту от предоставления сведений, которые являются недостоверными или порочащих честь, достоинство и деловую репутацию физического лица;

применять средства правовой защиты в случае нарушения законодательства о защите персональных данных;

вносить оговорки об ограничении права на обработку своих персональных данных во время предоставления согласия;

знать механизм автоматической обработки персональных данных;

на защиту от автоматизированного решения, которое имеет для него правовые последствия.

Если Вы хотите воспользоваться любым из вышеуказанных прав или получить дополнительную информацию, пожалуйста, свяжитесь с нами по реквизитам, которые указаны ниже в этой Политике конфиденциальности.

Однако, пожалуйста, обратите внимание, что эти права не являются абсолютными и могут несколько ограничиваться нормативными требованиями и нашими законными интересами.

Чтобы ответить на Ваш запрос, мы должны идентифицировать Вашу личность, чтобы Ваша Информация не была предоставлена ​​неуполномоченному лицу.

Сервис в течение десяти дней с момента получения Вашего запроса должна предоставить Вам информацию о действиях, предпринятых в связи с Вашим запросом. Срок предоставления окончательного ответа на Ваш запрос - до 30 дней с момента получения запроса. Однако для третьих лиц при ответе на запрос срок может быть продлен до 45 дней с момента получения запроса.

В случае, если Вы узнали, что кто-то противоправно предоставил нам Ваши Персональные Данные Сообщите нам об этом как можно скорее по контактным данным, указанным в настоящей Политике конфиденциальности. По Вашему запросу мы удалим Ваши Персональные Данные в кратчайшие сроки, но в любом случае не позднее одного месяца со дня получения Вашего запроса. Мы сохраним только такие копии Информации, которые могут быть необходимы нам с целью соблюдения требований Закона для таких случаев.

Кроме того, Вы можете в любой момент изменить (обновить, дополнить, удалить) предоставленные Вами Персональные данные обратившись к нам с соответствующим запросом.
''']),
    DropTextModel('ДЕТИ', <String>['''Мы понимаем насколько важным является принятие дополнительных мер для защиты приватности и безопасности детей, пользующихся Сервисом. Детям до 18 лет не разрешается использовать наш Сервис и получать наши услуги, если их родители не дали на это своего согласия, что должно подтверждаться соответствующими доказательствами. Мы не собираем целенаправленно Персональные данные детей в возрасте до 18 лет. Если мы узнаем, что нами были получены Персональные Данные ребенка в возрасте до 18 лет, за исключением вышеупомянутых обстоятельств, мы примем все необходимые меры для того, чтобы удалить такую Информацию как можно скорее, только если мы не обязаны хранить такие данные в целях соблюдения требований закона.''']),
    DropTextModel('ОБНОВЛЕНИЕ ЭТОЙ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ', <String>['''Каждый раз, когда мы вносим изменения в эту Политику конфиденциальности, новая версия будет доступна с пометкой “Новая редакция от ... “.

Вы можете получить доступ к новой редакции Политики Конфиденциальности с того самого дня, когда она вступает в силу, поэтому у Вас есть время, чтобы принять решение о дальнейшем пользовании сайтом и для направления своих возражений относительно изменений в обработке Ваших персональных данных. Проект новой Политики Конфиденциальности может быть опубликован заранее.
''']),
    DropTextModel('ПРАВА ТРЕТЬИХ ЛИЦ', <String>['''Для обеспечения выполнения обязательств перед пользователями, Сервис может осуществлять передачу данных о Пользователях, но исключительно в пределах как это необходимо для выполнения соответствующих услуг.''']),
    DropTextModel('ВОПРОСЫ И ЖАЛОБЫ', <String>['''Если у Вас возникли вопросы, беспокойства или жалобы относительно наших методов сбора и обработки Ваших Персональных данных, или если у Вас есть какие-то предложения или вопросы по этой Политики Конфиденциальности, свяжитесь с нами.''']),
    DropTextModel('КАК С НАМИ СВЯЗАТЬСЯ', <String>['''Реквизиты.
Егорова Галина Геннадьевна 
ИНН 424601190290
652300, Кемеровская область, 
г. Топки, ул. Лермонтова, д. 2, кв. 32
Email: support@rigelpsy.ru''']),

  ]);
}